[{"self_repo": "Hello, I am having a problem with the battery in my Asus Chromebook Flip. I have only had the computer for 2 years so I did not expect a battery issue so soon. I need the computer for a sales pitch I am giving tomorrow so I need this fixed immediately. ", "target": "Battery drain"}, {"self_repo": "I am having a problem with my laptop battery. It isn't holding a charge and drains quicker than it should. I have faced this issue a lot with my Samsung Notebook 7 force, and am disappointed in the product quality. This has continued for months lately.", "target": "battery memory effect"}, {"self_repo": "My laptop feels very hot to touch. I don't know why is this happening, it's a fairly new laptop.", "target": "BIOS upgrade causing overheating"}, {"self_repo": "I've had my Rivian R1T for about 1 year now. I just realized that there is an electrical failure in my car. I was planning on taking it to visit my parents in Indiana so I need the car fixed by then.", "target": "Blown fusible link"}, {"self_repo": "My 2 year old Acer Swift 3 refuses to boot up, it seems like the hard drive is dead. I have a lot of work stuff I need to work on so I need it fixed as fast as possible.", "target": "Boot order issue"}, {"self_repo": "The brakes aren't functioning properly in my Ford Expedition. I need your help to figure out what's wrong with them.", "target": "Brake pad issue"}, {"self_repo": "I have a lenovo flex for the past four years. I am able to connect to the wireless network with my laptop. I have to upload my artwork for my e-commerce website. It's really important for me to get online soon.", "target": "Connectivity"}, {"self_repo": "My HP Notebook 15 does not power up when I hit the on button and even when I plug in the power supply, the power LED stays off. I need to use my laptop to pay my bills so it would be really helpful if you can figure out the problem for me.", "target": "connector malfunction"}, {"self_repo": "For the past year I've used my Dell XPS 15 for work. Last night when it went to check my email, the hard drive wouldn't work. I cannot work without my laptop.", "target": "Controller failure"}, {"self_repo": "I have had the Asus TUF Gaming laptopa for the past 3 years. The power button is not responding and therefore not turning on the laptop. When the charger is plugged in, the LED light constantly flickers. This has been happening for the past 3 days. I need your help to fix this. Thanks.", "target": "Cord issue"}, {"self_repo": "My Honda Accord has experienced electrical failures three times since I bought it. I think it's doing it again. Please help me figure this out.", "target": "Corroded battery connectors"}, {"self_repo": "I have my HP Elite Dragonfly laptop and it's having some serious hard drive issues. It's hard to get any of my work done at home because of it.", "target": "Corrupted hard drive"}, {"self_repo": "My laptop has been having some hard drive issues for the past few weeks and it happens after I try to boot it up. It is a Lenovo ThinkPad X1 Extreme and I had for 3 years, but I need to get it fix before it gets worse and I can't use it anymore. Please help me urgently.", "target": "corrupted Windows installation"}, {"self_repo": "I've had my BMW X3 for 9 years now and it's making making really unusual noises that worry me. Is there anything you can do?", "target": "CV joint failure"}, {"self_repo": "My laptop is an Asus TUF FX505DT and I have owned it for 2 years. It works great, but it won't turn on whenever I press the power button. The LED light near it keeps flickering whenever I charge it. Please help, I need to know if my laptop can be fixed or not!", "target": "DC power jack failure"}, {"self_repo": "Help!  I am having issues with my laptop's monitor. I have an Acer laptop and I have had it for the last three years.  This needs to be fixed ASAP because I need to create some designs for my client. Every hour is crucial for me.", "target": "Display issue"}, {"self_repo": "My Jeep Grand Cherokee is making weird noises.  I've had it for four years, and it's done this at least three times in the last 18 months. Every time I get it repaired, this comes up again.", "target": "Exhaust leak"}, {"self_repo": "I am currently unable to start my vehicle. When I go in my car and turn the key, the engine doesn't turn over and the car does not start. There is not even an attempt to fire up the engine when I hold the key in the start position.", "target": "Fuel distribution"}, {"self_repo": "The hard drive on the Huawei Matebook 13 I've had for 3 years is giving out.", "target": "Hard drive failure"}, {"self_repo": "Hi. I currently have a Lenovo ThinkPad and I'm having some issues with it. About a day ago, when I was working on it, it's screen started acting up strangely. Please help.", "target": "Hard drive issue"}, {"self_repo": "My Lenovo ThinkPad X1 Extreme that I have had for the last 2 years is having some issues. I am sure it's the hard drive this time. It's the only part that hasn't been replaced now in this malfunctioning laptop. I really hope I don't have to replace it, can you suggest me what to do?", "target": "Hardware failure or corrupted driver"}, {"self_repo": "I have an year old HP Elite Dragonfly that is having issues.  The display is dim and barely visible. I wasn't able to wach my movie today because it was too hard to see what was going on.", "target": "Inverter"}, {"self_repo": "The brakes on my car are acting weird.  There is definitely something off. Can you please help me figure out what could be happening.", "target": "Loose bolt"}, {"self_repo": "I have had a Jeep Grand Cherokee for 5 years and the last week or so it's been making weird noises. When I am moving its making a ticking sound. I have been facing this issue every day for the last week and it doesn't seem to be going away.", "target": "Loose lug nuts"}, {"self_repo": "Laptop isn't powering on when I'm pressing the power button. This issue started a day ago. I can't live without a laptop and I can't afford another one! Please fix it!", "target": "Motherboard failure"}, {"self_repo": "I am unable to connect to the wifi on my Razor Blade Stealth. I've had it for 1 year and have not had any connection issues before. My wifi network is not visible. I don't understand why that would happen so please help.", "target": "Network visibility"}, {"self_repo": "I have an Asus ZenBook Pro Duo. It's not turning on when I press the power button. This is the 2nd time this has happened to me. I thought I fixed it the first time, but I guess not. I don't want to make things worse so I need some expert advice.", "target": "Non-functional power outlet"}, {"self_repo": "my car is having an electrical failure, i have had it 4 years.", "target": "Open circuit"}, {"self_repo": "My Jeep Cherokee keeps overheating.  I keep having to pull over and add water to it. I can drive it for about 10 minutes before it starts to overheat again. Please help me fix this.", "target": "Overheating"}, {"self_repo": "I own a Razer Blade Stealth laptop. There seems to be a problem with the laptop screen. I need it fixed ASAP since I have an important presentation to give, and the presentation is in the laptop.", "target": "Power failure"}, {"self_repo": "I got into my car this morning. I put my car key in the ignition switch and when I pushed the ignition toggle forward, it didn't do anything. It didn't try to start up or crank or make any noise at all. ", "target": "Starter relay failure"}, {"self_repo": "My Jeep Cherokee keeps overheating. This is the 7th year I've had this car and I like it a lot. But I need it to get to work, and I can't do it when this car overheats.", "target": "Thermostat"}, {"self_repo": "My Buick Enclave that I bought 1 year ago hasn't had any problems until recently. There is definitely something wrong with it's electrical systems. I don't have much experience with that so I need your expertise.", "target": "Voltage issue"}, {"self_repo": "My Cadillac Escalade ESV is getting so annoying to deal with. It overheats whenever I am at a stop light. People keep honking at me which is very embarrassing. I don't want this to happen again.", "target": "Water pump failure"}, {"self_repo": "I've had my Rivian R1T for about 9 years now. I took a road trip to Florida last week. While driving, I noticed some braking issues with the car. I was worried that I wouldn't make it to Florida.", "target": "ABS failure"}, {"self_repo": "I have a lincoln continental for the past 7 years. I have some issues with the braking capability on the car. I can't reply on them the same way anymore. This is very troublesome and I need it resolved.", "target": "ABS malfunction"}, {"self_repo": "My Rivian R1T has been having a steering problems. I almost got into an accident because of it. Please help me fix this asap.", "target": "Alignment"}, {"self_repo": "I have had this car for 5 years and I love this mercedes benz c-class as it has given me a lot of years and time together. It hardly ever breaks down and somehow it has come to symbolize who I really am - strong sturdy and classy and that's why I want to fix it no matter what it cost. It has been overheating since yesterday and I am not sure why because I just had it inspected and tested just a few day ago. Kindly look at the problem for me.", "target": "Antifreeze leak"}, {"self_repo": "There is some problem with my laptop display. I really need this problem to be fixed as soon as possible please! ", "target": "Backlight"}, {"self_repo": "I'm experiencing an electrical failure in my car. Twice in the last two weeks, I've noticed that my car battery has discharged quickly within a few days, even though I'm only driving my car five miles to the office and back. ", "target": "Battery"}, {"self_repo": "My laptop battery is not functioning properly for the last few weeks. Last week, it died as soon as I was supposed to start a company presentation, and it was very embarrassing. Please help me out!", "target": "battery charger problem"}, {"self_repo": "My laptop's hard drive acting up lately and I don't know why. It's a two year old Acer Swift 3.", "target": "Battery issue"}, {"self_repo": "Hello, I am having a problem with my Acer Swift 3's battery. I have had the computer for about one year but now I think the battery is not charging properly or it is busted.", "target": "Battery replacement"}, {"self_repo": "My Toshiba laptop refuses to turn on. I tried pressing the power button again and again but it is dead. I don't understand why this is happening. I have always taken great care of my laptop. What should I do?", "target": "Beep Codes"}, {"self_repo": "I am an owner of a Honda Accord. I've had this car for nine years now. I am experiencing an issue with the car's steering. Also, it seems the car vibrates at high speeds. Not sure if the two are related. When I am driving on the highway, the vibration is very bad, and the whole steering wheel shakes.", "target": "Bent axle"}, {"self_repo": "My Infiniti QX60, that I use to get to work, has steering problems. It's been fine the last 4 years. Please help me.", "target": "Bent part"}, {"self_repo": "I'm having some problems with the battery on my Lenovo IdeaPad S540 that I've owned for the last two years. Can you please help me out?", "target": "BIOS power controller"}, {"self_repo": "I have a Kia Telluride that I have owned for 7 years.  The problem is that it won't start.  When I turn the key, nothing happens.  What do you think is wrong?", "target": "Blink codes issue"}, {"self_repo": "For 2 years I have had a Honda CR-V and today I noticed the wipers are not working. They I also noticed the same issue with the radio as well. The electrical system is messed up. I need to get it fixed ASAP to take my daughter to her graduation next week.", "target": "Blown fuse"}, {"self_repo": "My car makes a loud ticking noise when I am driving, it was so loud that I got pulled over by a police officer who was concerned! I explained I thought it was a mechanical issue and would get it into the mechanic asap.", "target": "brake adjusters"}, {"self_repo": "Lately, I have been having trouble with the brakes of my car. I have checked it again and again but can't figure out what's causing this. Can you please help me.", "target": "Brake fluid overflow"}, {"self_repo": "I've had this Chevrolet Camaro for 5 years and when I use the brake pedal I hear this strange noise. I don't understand where it is coming from or what's causing this.", "target": "Brake pad vibration"}, {"self_repo": "My car started having some braking problems on my way to work yesterday, so I had to pull over on the side of the road and take an Uber instead. ", "target": "brake problem"}, {"self_repo": "hello, my 2015 honda accord has been exhibiting some problem with the brakes and i have not been able to drive it to work for a while. what could the problem be?", "target": "Brake wear"}, {"self_repo": "My car won't start, it just stalls every time the key releases. Please help me fix this.", "target": "Broken ignition switch"}, {"self_repo": "My car is acting like it might have some sort of electrical failure.  I really need to get it fixed immediately, because I'm supposed to leave to go on a road trip in a few days.", "target": "Bulb failure"}, {"self_repo": "There's been an electrical failure in my Infiniti QX60. I'm not sure how the problem was created. ", "target": "bulb replacement"}, {"self_repo": "I have a Lenovo IdeaPad. When I use it for more than 15 minutes, it starts to overheat without much warning. This problem just started this week and I really need to get it fixed so that I don't lose all my precious data.", "target": "Burnt motherboard"}, {"self_repo": "I can't brake my car properly, so I'm constantly stressed whenever I'm backing out since I'm worried that I'll run into another car. ", "target": "Cable issue"}, {"self_repo": "I have had my Lincoln MKC for the past three years and it will not start. This has caused me to use vacation days because I can not get to work.", "target": "cap erosion"}, {"self_repo": "I am unable to start my car. I think there's something wrong with the spark plug because every time I try to turn the engine over, it just sputters. I have to drive to take my mother to surgery tomorrow and need the car fixed as soon as possible.", "target": "Carburetor issue"}, {"self_repo": "I've had a huawei matebook 13 for about 13 months and now I keep having this problem. There is something wrong with the lcd display. This first happened when I was working on a powerpoint presentation for work.", "target": "CCFL malfunction"}, {"self_repo": "I was getting ready to go to office as usual in my Dodge Durango which does not start. When I insert the key and try to start the vehicle does start but stalls immediately. I have had a very bad time today. I have never had a trouble like this in my 8 years of driving this vehicle. ", "target": "Choke stuck"}, {"self_repo": "My Cadillac ATS has been overheating every time I drive it. I need this vehicle for work, and I know a 9 year old car can need work, but can I get it done asap?", "target": "Clogged radiator"}, {"self_repo": "I have a BMW X3. Every time I take it out on a hot day, it overheats. I was at the gas station and filled up some gas after a 30m drive and it overheated. I had to call someone for help. I need to fix this soon.", "target": "Coolant temperature light issue"}, {"self_repo": "I've been driving my Subaru Ascent for at least 10 years. I've only had it overheat one time before. But now it is constantly overheating. Please help me fix this. This is causing me a lot of inconvenience.", "target": "cooling system problem"}, {"self_repo": "My car's steering has been having issues especially when I'm driving on roads that are winding. I need your help to fix this.", "target": "Cotter pin issue"}, {"self_repo": "the engine does not start when i turn the key, this has been happening frequently last night i tried to start it for 30 min until it finally started .", "target": "cracked coil or cracked distributor"}, {"self_repo": "I've owned my Mercedes-Benz C-Class for the last 8 years but lately, every day for the past week, the steering has had issues when I'm driving on a highway. Please diagnose this for me.", "target": "CV joints"}, {"self_repo": "My 2004,  Chrysler, PT Cruiser will not start although it started yesterday. It does not turn over when I start it so I will need your help.", "target": "Dead battery"}, {"self_repo": "I've had a Lincoln MKC for the last year but my car has been making some unusual noises. This is a huge headache for me because my stress levels skyrocket every time I hear those noises while I'm driving to work. I would like to figure this out at the earliest.", "target": "Debris"}, {"self_repo": "As I am stopping while driving my Jeep Cherokee, I noticed an electrical issue. I'm concerned if it may just shut down while I'm driving which could be fatal. What do I do?", "target": "Drive belt"}, {"self_repo": "I've had this Lenovo IdeaPad for three years and it's worked great until recently when it stopped connecting to the internet. I've tried everything to get it to connect to the wireless network and I need to be able to get online for school but it won't recognize my wireless network. School starts in two days and I need to be able to get online.", "target": "Driver issue"}, {"self_repo": "I am facing some braking problem with my toyota camry. I am able to stop my car but I feel as though the brakes aren't working properly. Can you help me figure of if there is any serious issue with my car?", "target": "Emergency brake switch"}, {"self_repo": "So I need to have my nissan maxima back on the road ASAP for my family vacation. It's overheating whenever I go over 55. Please help.", "target": "engine flush"}, {"self_repo": "So my Nissan Maxima has been making some unusual noises. When I try to start her up, the noises are pretty bad. I've had it for six years and I've kept it in pretty good condition until now so I'm not entirely sure what's wrong with it.", "target": "Expansion/contraction"}, {"self_repo": "I have owned an ACER Aspire E 15 for two years without problems but now it is unresponsive. It just refuses to start. I want to video call with my mother so I need this fixed as a matter of urgency. ", "target": "External device interference"}, {"self_repo": "My Volvo S60 keeps overheating on a regular basis. I don't know what to do about it. I have no one that can help me with this so I really need your help.", "target": "fan or temperature sensor failure"}, {"self_repo": "My car just starts making unusual sounds and it seems to be happening every few months for the past year. I would like this to be fixed once and for all.", "target": "Faulty ball joint"}, {"self_repo": "My 2 year old Razer Blade QHD is starting to worry me. There must be something wrong with the battery. Can you help me troubleshoot?", "target": "faulty battery"}, {"self_repo": "My car will not start.  I went to the store and parked in the parking lot and when I can out, I turned the key but nothing happened.  The car just won't start and this has never happened with this car before.", "target": "Fuel injector problem"}, {"self_repo": "my lincoln will not start this morning, this has happened several times in the last week.  I really need to get it fixed. ", "target": "Fuel issue"}, {"self_repo": "My laptop has been overheating a lot. Please help me fix it. I can't take it to the repair shop because of the lockdown.", "target": "Hardware failure"}, {"self_repo": "I drive a Chevrolet Camaro, and for the past two years, every month or so my car overheats and steam comes out of the cooling system. I go for camping on weekends and taking a steaming car is a huge risk. I need to have this fixed soon.", "target": "Heater core malfunction"}, {"self_repo": "I've had  Subaru Impreza for 2 years now. The brakes are failing me. The other day I rear ended  car because they failed to work properly.", "target": "High spot on the rotor"}, {"self_repo": "I am unable to start my Lincoln Continental. I think the problem is major, because I've only had the car for a week. Since I can't drive the car, I have to beg my significant other to drop and pick me from work every day. This situation is really stressing me out. PLease help me fix this.", "target": "Ignition system wiring or voltage regulator issue"}, {"self_repo": "hello, I have an Acer Aspire laptop for 2 years now and never had a problem before and but now i cannot connect to the wireless network any more. I work from home so its very critical this gets fixed right away. So please help me out asap.", "target": "Incompatibility"}, {"self_repo": "My Asus VivoBook X403, which I've had for 3 years now, is suddenly having problems connecting to the wireless network and is preventing me from doing work. I cannot connect even when the network security is disabled on the router.", "target": "Interference"}, {"self_repo": "Hello, I am having much trouble with my laptop. I cannot access my work files which I must do urgently. I cannot connect to the wireless network on my Asus Chromebook. When it does connect, the connection is intermittent. I urgently need your help to fix this.", "target": "ISP issue"}, {"self_repo": "I have a Honda Accord and my brakes are failing. I have to press them all the way to make the car stop. The other day I almost ran into another car because of this. I am worried I will run into an accident so I want to resolve this soon.", "target": "jamming"}, {"self_repo": "My laptop does not boot up when I press the power button. It is a Lenovo Flex 14 and I have owned it for three years. I need it repaired as soon as possible. It has been hampering my work because I use it for graphic design. So it is urgent that I get it fixed.", "target": "LCD display issue"}, {"self_repo": "I have a school assignment i need to do and my laptop has some display issue. It is Lenovo IdeaPad S540.", "target": "LCD fault"}, {"self_repo": "Recently I've noticed that my HP Dragonfly's display has not been running as smoothly as supposed to and I can't figure out what has happened. I can't see the images properly and I need to work on some edits for my client so please help.", "target": "LCD leakage"}, {"self_repo": "My Asus Chromebook Flip is having some hard drive issue and i am not sure what is causing them.", "target": "LCD malfunction"}, {"self_repo": "I've owned my Cadillac ATS for the last two years but the steering has been malfunctioning. I'm going out of town tomorrow for a trip, so I really need this problem fixed right away.", "target": "Leak"}, {"self_repo": "I have a Huawei MateBook 13, it’s an older model, approximately five years old. I’ve been having issues switching it on whenever I press the power button. It does not respond at all. I hope you can help me. ", "target": "Loose connections"}, {"self_repo": "I have a laptop that is having problems and I believe it is the hard drive. The laptop is a Razer Blade Stealth that I bought 3 years ago and has worked perfectly until this week. I have checked the internet to see if I could figure it out but was unable to. Please help.", "target": "Loose connector"}, {"self_repo": "I have a HP Noteboik 15.  I was having a Zoom party when my display started acting up. Can you help me?", "target": "Loose display connectors"}, {"self_repo": "My steering wheel is acting abnormally. I have a Volvo s60, and I've owned it for the past year. Never had this problem before until the past month.", "target": "Loose rack"}, {"self_repo": "I hit a tire in the road and now my BMW X3 is making a funny noise. Can you help me figure out how to fix this?", "target": "Loose wire"}, {"self_repo": "Every week I experience same issues with my laptop. I am constantly having problems connecting to WiFi. Because I am not able to connect my laptop to Internet, I can't participate well in my online classes. Can you help me please?", "target": "Malfunction"}, {"self_repo": "I have a 3 year old HP Spectre x360 laptop that does not turn on when I press the power button.  I have tried a lot to fix this but it does not work. The power LED does not light up even when I plug in the power supply.  Can you please help me?", "target": "Malfunctioning internal device"}, {"self_repo": "I've had a Samsung Notebook for the last 2 years. It's been overheating and the fan doesn't run at all. I've had to take it to three different tech specialists and it's caused me a lot of anxiety. ", "target": "malfunctioning motherboard or RAM"}, {"self_repo": "On my way home from the grocery store, my car started acting up. There was some problem with the steering. I am not an expert on this so I need your advice.", "target": "Mechanical"}, {"self_repo": "I have a 3 year old Razer Blade QHD laptop that I often have hard drive problems with. The operating system wouldn't boot at all and I don't know what to do.", "target": "Motherboard malfunction"}, {"self_repo": "I own a Nissan Murano, and I found out that there's an electrical failure. I'm not sure what caused it.", "target": "multiple light failure"}, {"self_repo": "I have an Asus VivoBook.  My wife is out of town and want to zoom with her tonight so I can see her.  Something is wrong with the wireless network and I can't connect.  Please help me with this.", "target": "Network connectivity issue"}, {"self_repo": "I'm having a problem with the battery on my Asus ZenBook Pro, which I have owned for the last 3 years. I need to do some investigation when traveling. I can't really do that with a battery like this.", "target": "Overdischarge"}, {"self_repo": "My laptop is malfunctioning due to over-heating issues. I think that the laptop fans are not working. This could be causing the overheating. It is very inconvenient as this is my main laptop that I take to work and my work has fallen behind due to this. ", "target": "Overheating shutdown"}, {"self_repo": "I've had this Nissan Maxima for over 8 years now, and it wont start now. I put the key in and pushed it to start, the starter doesnt spin. I have a big date tomorrow night with a woman I've been trying to go out with, so I really need to have it fixed today.", "target": "Oxidation"}, {"self_repo": "I've been using this Toyota Camry for 10 years now. I just recently discovered an electrical failure in it while driving to school. Can you please help me localize the issue.", "target": "Parasitic drain"}, {"self_repo": "I plugged in my laptop when I got home from work and for some reason it always has trouble finding my wireless network. Whenever I go to work, it never reconnects to my wireless network when I get home.", "target": "Password"}, {"self_repo": "My car has started making strange noises and it disturbs the neighbors in the morning when I go to work. It's a Ford Mustang and its only two years old. Do you know what it could be?", "target": "Pebbles in wheel covers"}, {"self_repo": "There's something wrong with my 2 year old ThinkPad X1 Yoga. The battery charger is making an awful humming sound. This has made it disruptive to use in the office.", "target": "power adapter"}, {"self_repo": "My Asus Zenbook 14 is acting up again. It won't turn on when I hit the power button.  I tried every fix I can think of but now I'm tired of it. I hope you can figure this out. ", "target": "Power button issue"}, {"self_repo": "I have been using a HP Notebook the past year. When I try to start the laptop via the power button, the laptop does not turn on. Also, it's power LED does not light up when the power supply is plugged into the power socket. I need a laptop to work. Please fix it!", "target": "Power connector issue"}, {"self_repo": "I need help figuring out what's wrong with the battery in my laptop. I hope you can figure it out for me.", "target": "Power drain"}, {"self_repo": "I have a laptop that has had overheating issues ever since I bought it. I had it fixed a handful of times but it still overheats frequently and I need it fixed asap. ", "target": "Power management"}, {"self_repo": "I've had my Razer Blade Stealth for 3 years now. The battery failed on me when I was in a Zoom meeting. I can't figure out the issue but it is definitely a problem with the battery.", "target": "Power plan"}, {"self_repo": "I have a Jeep Cherokee and the steering is giving me trouble. I have no clue why is this happening so I could use your help with this.", "target": "Power steering pump issue"}, {"self_repo": "I just bought this Kia Telluride, and I see steam coming out from the front of the hood. It must be overheating, but I don't know why. Help me figure it out please.", "target": "Pressure relief system failure"}, {"self_repo": "My Jeep has some steering problems. It is really unsafe to drive. Please suggest me a way to fix this.", "target": "Pump failure"}, {"self_repo": "My car continues to overheat. The hood is so hot that I think I could melt cheese on the hood! Please help.", "target": "Radiator leak"}, {"self_repo": "I need your help.  I am currently unable to connect to the wireless network on my ZenBook Pro.  I've had this laptop for almost two years and have never had this issue before. Currently, the wireless network is not even visible on my laptop. I need this fixed ASAP as I have an important work report that needs to be completed by the end of the day.", "target": "Reset"}, {"self_repo": "I've have a Lenovo IdeaPad for the last 2 years. It has an LCD display which seems to have some problem. I am not sure if there is some setting problem or if my hardware is malfunctioning. Can you help?", "target": "Resolution"}, {"self_repo": "Hi. I've had a Razer Blade Stealth for about 4 years. I'm having issues connecting to wifi and it's the only way I can talk to my husband who is stationed abroad. I need to have this fixed ASAP!", "target": "Router malfunction"}, {"self_repo": "I am unable to get online again, this is the fifth time this month. My Lenovo ThinkPad X1 Extreme is just one year old but I just can't connect to it. This is so frustrating, please help.", "target": "Router reset"}, {"self_repo": "My car's brakes are no longer in working order. I don't want to run into any accident because of them. Please help me fix this.", "target": "rust or malfunctioning return spring"}, {"self_repo": "I recently borrowed ASUS VivoBook 15 from my friend and it has been giving me display problems. Please help!", "target": "Screen rotation"}, {"self_repo": "My car is starting, but it stalls just moments after. I can't go to work because of this.", "target": "sensor"}, {"self_repo": "I have owned a Ford Expedition for the past 3 years, and lately, there has been a major issue with the electrical system. It is affecting my drive to work everyday. ", "target": "Short circuit"}, {"self_repo": "I am unable to start my car. I cannot get to work which is costing me money. Please help me fix this soon.", "target": "spark control system"}, {"self_repo": "I've had my BMW X7 for the last 8 years, but for the last two months, I've experienced a braking issue at least once a week during my commute to work. ", "target": "Spring clips"}, {"self_repo": "I can't get my car to start. It's a Nissan Murano that I have had for one year. When I put the key in the ignition and turn, it seem like it wants to start, but it can't. I did help someone jump start their car the other day with my battery, not sure if maybe something wasn't connected right after that.", "target": "Starter problem"}, {"self_repo": "My car is a Subaru Ascent. I had a major problem because of my brakes yesterday. I am very scared to drive it now. Can you please help me fix it so that this doesn't happen again?", "target": "Stuck piston or over-adjusted shoes"}, {"self_repo": "My Lexus ES's steering is really messed up, it's actually making me scared to drive it at all and I need it for work.", "target": "Tie rod"}, {"self_repo": "My Subaru Impreza seems to be having some steering problems when I'm driving at high speeds. The vibrates constantly when I try to drive fast. Please tell me what is causing this? ", "target": "Tire damage"}, {"self_repo": "Hello, I have a 2016 Cadillac Escalade that is making this weird ticking sound when I drive.This is very annoying, because first, I do not why this is happening and second, I am not sure that it is a serious or minor issues. This sound is bothering me a lot. I try to play my radio loud, but i can still hear it. Please tell me how to fix this.", "target": "Transmission issue"}, {"self_repo": "It seems that my laptop is having some issues with the hard drive.  Every time I try to start my Asus ZenBook 14, the operating system doesn't boot.  I need this laptop to complete a work project.  Please assist me at your nearest convenience.", "target": "Unknown"}, {"self_repo": "I have had my asus zenboook for four years now and the screen is behaving weird for the first time. Can you help me fiure this out?", "target": "Video problem"}, {"self_repo": "For the past 10 years I've had a Razer Blade Stealth but lately it's been having problems with the lcd screen. ", "target": "Video processor"}, {"self_repo": "My laptop won't boot up, I think it is a hard drive issue. I am using a 3 year old HP Spectre x360 13.", "target": "Virus/malware identification and OS restoration"}, {"self_repo": "I've had my Cadillac Escalade ESV for the last 7 years, but I recently tried to drive my car at 60 mph on the highway and noticed some problems that I think indicate an electrical failure. ", "target": "Voltage regulator"}, {"self_repo": "I didn't drive my car all winter and now, for reasons I don't understand, it's making unusual noises.  I'm hesitant to drive it anymore until I get it fixed.  It's a Lincoln Continental and I've only owned it for about a year, which makes this even worse.", "target": "Warped rotor"}, {"self_repo": "Hi, I have a GMC Canyon. I've had it for six years. Recently it overheats all the time now. Also, steam continually billows from the cooling system. What should I do to fix that? Please advise! It's really embarrasing to drive a steaming car.", "target": "Water pump leak"}, {"self_repo": "I have a Mercedes-Benz C-Class. I have been taking good care of it since the last 10 years. But now out of the blue, I am experiencing some trouble with my brakes. I need your help to resolve this. I love my car and I don't want it to brake down.", "target": "Wheel bearing"}, {"self_repo": "I've had my Volkswagen Atlas for the last 9 years but the steering hasn't been working recently. I hope you can suggest me something to fix it.", "target": "Wheel imbalance"}, {"self_repo": "My Razer Blade Stealth  is having some hard drives issues and the system is not booting up. Please suggest me what should I do?", "target": "Windows installation problem"}, {"self_repo": "I have an Lenovo Ideapad, and I am unable to connect to the wireless network. I am unable to resolve this on my own and I need your help. I have a lot of work pending so it is quite urgent for me.", "target": "Wireless adapter issue"}, {"self_repo": "I have a HP Elite Dragonfly for the past year. I dropped it today and I am very worried I might have damaged the screen. It's acting very strange. Please help me! ", "target": "Wiring issue"}, {"self_repo": "I have BMW X7 which is just a year old but it is already acting strangely. The steering wheel is definitely not normal to use. This is strange because the car is almost brand new.", "target": "worn lower ball joint"}, {"self_repo": "I need my Lexus ES fixed right now. The brakes are out and are endangering me and my child.", "target": "Worn parts"}, {"self_repo": "My Hyundai Elantra is having some problems with the steering. Please suggest me something. I've had the car for 10 years. ", "target": "Worn steering coupling"}]